{
  "basics": {
    "name": "Raul Podar",
    "label": "Android Engineer",
    "image": "",
    "email": "raulpodar0@gmail.com",
    "phone": "00447493551657",
    "url": "Portfolio URL",
    "summary": "Experienced Android Engineer with over 5 years in the software industry. I am passionate about mentoring, which not only allows me to share knowledge but also deepens my understanding. I excel in taking a systemic approach to problem-solving, driving projects forward with scalable and efficient solutions.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "London",
      "countryCode": "GB",
      "region": ""
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "Raul Marius Podar",
        "url": "LinkedIn Profile URL"
      }
    ]
  },
  "work": [
    {
      "name": "Sky",
      "position": "Android Engineer",
      "url": "",
      "startDate": "2024-02-01",
      "endDate": "",
      "summary": "Entrusted by management to lead and maintain a critical legacy project generating £30 million per quarter. Acted as the Tech Lead, ensuring the project's continued success and stability.",
      "highlights": [
        "Owned the release process and incorporated long-overdue automations that saved up to 3 hours for each merge into our config repository.",
        "Mentored three junior members by proactively reviewing their code and guiding them through the project, helping them earn confidence and greater ownership.",
        "Finalized a migration to Mediatailor resulting in approximately £1 million saved annually on fees and enabling live personalized ads for users.",
        "Managed the tech-debt backlog and led tech sessions to share knowledge within the team.",
        "Ensured a smooth transition to ExoPlayer after a complex and time-consuming team effort."
      ]
    },
    {
      "name": "NiloHealth",
      "position": "Android and iOS Engineer",
      "url": "",
      "startDate": "2022-09-01",
      "endDate": "2023-12-01",
      "summary": "Worked closely with the Product team to better define the requirements of the Mobile Apps.",
      "highlights": [
        "Responsible for releases to AppStore and PlayStore, ensuring no critical bugs are released.",
        "Created an automation script that reduced person-hours by 2 hours for every release (Python).",
        "Developed novel features for Android (Compose and Coroutines) and iOS (Swift UI) that increased content activation by 25% and doubled the number of registrations to roundtable events.",
        "Restructured the data layer of mobile apps using newly introduced design patterns (e.g., Repository).",
        "Contributed to architectural adjustments within the UI layer, resulting in loosely coupled code and reducing critical bugs (UI freezes) by 40%.",
        "Responsible for research, ticket definitions, and development of various features, such as local notifications for both mobile platforms."
      ]
    },
    {
      "name": "Sky",
      "position": "Android Mobile Developer",
      "url": "",
      "startDate": "2021-09-01",
      "endDate": "2022-09-01",
      "summary": "Led the development of a GraphQL middleware for an R&D project to investigate optimizations of API calls.",
      "highlights": [
        "Voted by peers as the winner of the Mobile Academy after a training program.",
        "Practiced Agile development within the Sky Go Android team, using TDD and maintaining a feature-based modular application following an MVVM architecture.",
        "Led the UI development of a new Splash Screen in Compose.",
        "Responsible for the development of the CI/CD pipeline in Jenkins as part of an educational project."
      ]
    },
    {
      "name": "Phlashweb",
      "position": "Web Developer",
      "url": "",
      "startDate": "2019-08-01",
      "endDate": "2019-12-01",
      "summary": "Captured reusable components of a Laravel (PHP) web application and optimized the code.",
      "highlights": [
        "Created testing sandboxes and performed several server migrations.",
        "Implemented parts of existing WordPress projects.",
        "Responsible for fixing various visual bugs to improve website responsiveness."
      ]
    },
    {
      "name": "Queen Mary University of London",
      "position": "Laboratory Demonstrator",
      "url": "",
      "startDate": "2019-09-01",
      "endDate": "2021-04-01",
      "summary": "Assisted with the delivery of practical exercises for level 4 and 5 modules.",
      "highlights": [
        "Managed groups of students by guiding them weekly based on a semester-long project (Software Engineering).",
        "Helped with assessments of coursework and provided feedback to students.",
        "Assisted in modules: Software Engineering, Algorithms and Data Structures, Procedural Programming, Computer Systems and Networks, Logic and Discrete Structures, Fundamentals of Web Technology."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Queen Mary University of London",
      "location": "London, United Kingdom",
      "url": "",
      "area": "Computer Science",
      "studyType": "BSc",
      "startDate": "",
      "endDate": "2021-01-01",
      "score": "First-class Honours (average mark of 85)",
      "courses": ["Big Data", "Distributed Systems", "Artificial Intelligence", "Bayesian Risk and Analysis", "Software Engineering"]
    }
  ],
  "awards": [
    {
      "title": "Winner of the Mobile Academy",
      "date": "2021-11-01",
      "awarder": "Sky",
      "summary": "Voted the winner of the Mobile Academy after a training programme in mobile development for iOS and Android."
    },
    {
      "title": "Science and Engineering Excellence Scholarship",
      "date": "2018-09-01",
      "awarder": "Queen Mary University of London",
      "summary": "Awarded 3 times with the Science and Engineering Excellence Scholarship."
    },
    {
      "title": "Finalist in Entrepreneurship Development Programme",
      "date": "2021-04-01",
      "awarder": "Queen Mary University of London",
      "summary": "Finalist for an entrepreneurship development programme."
    },
    {
      "title": "Future Global Leaders Forum Winner",
      "date": "2020-05-01",
      "awarder": "Queen Mary University of London",
      "summary": "Among the winners of the 'Future Global Leaders Forum' as part of a group project."
    },
    {
      "title": "4th Place in Regional SCARA Robot Arm Competition",
      "date": "2017-02-01",
      "awarder": "Luigi Cerebotani",
      "summary": "Placed 4th in a regional competition between high schools for building a SCARA robot arm."
    },
    {
      "title": "Mentioned in 'Giornale di Brescia' Newspaper",
      "date": "2016-01-01",
      "awarder": "Giornale di Brescia",
      "summary": "Mentioned in the local newspaper 'Giornale di Brescia' for academic achievement while in High School."
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Italian",
      "fluency": "Native",
      "icon": ""
    },
    {
      "language": "Romanian",
      "fluency": "Native",
      "icon": ""
    }
  ],
  "publications": [
    // {
    //   "name": "Laboratory Demonstrator",
    //   "publisher": "Queen Mary University of London",
    //   "releaseDate": "2019-09-01 - 2021-04-30",
    //   "url": "",
    //   "summary": "Assisted with the delivery and assessments of practical exercises for level 4 and 5 modules. Responsible for managing groups of BSc Software engineering students and guiding them on a semester-long project."
    // },
    // {
    //   "name": "Mentor at Buddy Scheme",
    //   "publisher": "Queen Mary University of London",
    //   "releaseDate": "2020-01-01 - 2021-01-01",
    //   "url": "",
    //   "summary": "Helped first-year students adapt to the community by organizing events, holding bi-weekly sessions to relieve academic stress, and providing study and organizational tips."
    // },
    // {
    //   "name": "Mentor for Junior Developers",
    //   "publisher": "Sky",
    //   "releaseDate": "2021-11-01 - 2022-06-01",
    //   "url": "",
    //   "summary": "Guided three junior developers by organizing knowledge-sharing meetings on Software Engineering topics, providing ad-hoc support, reviewing PRs, and offering constructive feedback."
    // }
  ],
  "certificates": [],
  "skills": [],
  "interests": [],
  "references": [],
  "projects": []
}
